Layer (type)                    Output Shape         Param #     Connected to
==================================================================================================
input_1 (InputLayer)            [(None, 224, 224, 3) 0
__________________________________________________________________________________________________
conv2d_120 (Conv2D)             (None, 112, 112, 64) 9472        input_1[0][0]
__________________________________________________________________________________________________
batch_normalization_121 (BatchN (None, 112, 112, 64) 256         conv2d_120[0][0]
__________________________________________________________________________________________________
re_lu_121 (ReLU)                (None, 112, 112, 64) 0           batch_normalization_121[0][0]
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 56, 56, 64)   0           re_lu_121[0][0]
__________________________________________________________________________________________________
sequential_61 (Sequential)      (None, 56, 56, 32)   45984       max_pooling2d_1[0][0]
__________________________________________________________________________________________________
concatenate_58 (Concatenate)    (None, 56, 56, 96)   0           max_pooling2d_1[0][0]
                                                                 sequential_61[0][0]
__________________________________________________________________________________________________
sequential_62 (Sequential)      (None, 56, 56, 32)   50208       concatenate_58[0][0]
__________________________________________________________________________________________________
concatenate_59 (Concatenate)    (None, 56, 56, 128)  0           concatenate_58[0][0]
                                                                 sequential_62[0][0]
__________________________________________________________________________________________________
sequential_63 (Sequential)      (None, 56, 56, 32)   54432       concatenate_59[0][0]
__________________________________________________________________________________________________
concatenate_60 (Concatenate)    (None, 56, 56, 160)  0           concatenate_59[0][0]
                                                                 sequential_63[0][0]
__________________________________________________________________________________________________
sequential_64 (Sequential)      (None, 56, 56, 32)   58656       concatenate_60[0][0]
__________________________________________________________________________________________________
concatenate_61 (Concatenate)    (None, 56, 56, 192)  0           concatenate_60[0][0]
                                                                 sequential_64[0][0]
__________________________________________________________________________________________________
sequential_65 (Sequential)      (None, 56, 56, 32)   62880       concatenate_61[0][0]
__________________________________________________________________________________________________
concatenate_62 (Concatenate)    (None, 56, 56, 224)  0           concatenate_61[0][0]
                                                                 sequential_65[0][0]
__________________________________________________________________________________________________
sequential_66 (Sequential)      (None, 56, 56, 32)   67104       concatenate_62[0][0]
__________________________________________________________________________________________________
concatenate_63 (Concatenate)    (None, 56, 56, 256)  0           concatenate_62[0][0]
                                                                 sequential_66[0][0]
__________________________________________________________________________________________________
sequential_67 (Sequential)      (None, 28, 28, 128)  33920       concatenate_63[0][0]
__________________________________________________________________________________________________
sequential_68 (Sequential)      (None, 28, 28, 32)   54432       sequential_67[0][0]
__________________________________________________________________________________________________
concatenate_64 (Concatenate)    (None, 28, 28, 160)  0           sequential_67[0][0]
                                                                 sequential_68[0][0]
__________________________________________________________________________________________________
sequential_69 (Sequential)      (None, 28, 28, 32)   58656       concatenate_64[0][0]
__________________________________________________________________________________________________
concatenate_65 (Concatenate)    (None, 28, 28, 192)  0           concatenate_64[0][0]
                                                                 sequential_69[0][0]
__________________________________________________________________________________________________
sequential_70 (Sequential)      (None, 28, 28, 32)   62880       concatenate_65[0][0]
__________________________________________________________________________________________________
concatenate_66 (Concatenate)    (None, 28, 28, 224)  0           concatenate_65[0][0]
                                                                 sequential_70[0][0]
__________________________________________________________________________________________________
sequential_71 (Sequential)      (None, 28, 28, 32)   67104       concatenate_66[0][0]
__________________________________________________________________________________________________
concatenate_67 (Concatenate)    (None, 28, 28, 256)  0           concatenate_66[0][0]
                                                                 sequential_71[0][0]
__________________________________________________________________________________________________
sequential_72 (Sequential)      (None, 28, 28, 32)   71328       concatenate_67[0][0]
__________________________________________________________________________________________________
concatenate_68 (Concatenate)    (None, 28, 28, 288)  0           concatenate_67[0][0]
                                                                 sequential_72[0][0]
__________________________________________________________________________________________________
sequential_73 (Sequential)      (None, 28, 28, 32)   75552       concatenate_68[0][0]
__________________________________________________________________________________________________
concatenate_69 (Concatenate)    (None, 28, 28, 320)  0           concatenate_68[0][0]
                                                                 sequential_73[0][0]
__________________________________________________________________________________________________
sequential_74 (Sequential)      (None, 28, 28, 32)   79776       concatenate_69[0][0]
__________________________________________________________________________________________________
concatenate_70 (Concatenate)    (None, 28, 28, 352)  0           concatenate_69[0][0]
                                                                 sequential_74[0][0]
__________________________________________________________________________________________________
sequential_75 (Sequential)      (None, 28, 28, 32)   84000       concatenate_70[0][0]
__________________________________________________________________________________________________
concatenate_71 (Concatenate)    (None, 28, 28, 384)  0           concatenate_70[0][0]
                                                                 sequential_75[0][0]
__________________________________________________________________________________________________
sequential_76 (Sequential)      (None, 28, 28, 32)   88224       concatenate_71[0][0]
__________________________________________________________________________________________________
concatenate_72 (Concatenate)    (None, 28, 28, 416)  0           concatenate_71[0][0]
                                                                 sequential_76[0][0]
__________________________________________________________________________________________________
sequential_77 (Sequential)      (None, 28, 28, 32)   92448       concatenate_72[0][0]
__________________________________________________________________________________________________
concatenate_73 (Concatenate)    (None, 28, 28, 448)  0           concatenate_72[0][0]
                                                                 sequential_77[0][0]
__________________________________________________________________________________________________
sequential_78 (Sequential)      (None, 28, 28, 32)   96672       concatenate_73[0][0]
__________________________________________________________________________________________________
concatenate_74 (Concatenate)    (None, 28, 28, 480)  0           concatenate_73[0][0]
                                                                 sequential_78[0][0]
__________________________________________________________________________________________________
sequential_79 (Sequential)      (None, 28, 28, 32)   100896      concatenate_74[0][0]
__________________________________________________________________________________________________
concatenate_75 (Concatenate)    (None, 28, 28, 512)  0           concatenate_74[0][0]
                                                                 sequential_79[0][0]
__________________________________________________________________________________________________
sequential_80 (Sequential)      (None, 14, 14, 256)  133376      concatenate_75[0][0]
__________________________________________________________________________________________________
sequential_81 (Sequential)      (None, 14, 14, 32)   71328       sequential_80[0][0]
__________________________________________________________________________________________________
concatenate_76 (Concatenate)    (None, 14, 14, 288)  0           sequential_80[0][0]
                                                                 sequential_81[0][0]
__________________________________________________________________________________________________
sequential_82 (Sequential)      (None, 14, 14, 32)   75552       concatenate_76[0][0]
__________________________________________________________________________________________________
concatenate_77 (Concatenate)    (None, 14, 14, 320)  0           concatenate_76[0][0]
                                                                 sequential_82[0][0]
__________________________________________________________________________________________________
sequential_83 (Sequential)      (None, 14, 14, 32)   79776       concatenate_77[0][0]
__________________________________________________________________________________________________
concatenate_78 (Concatenate)    (None, 14, 14, 352)  0           concatenate_77[0][0]
                                                                 sequential_83[0][0]
__________________________________________________________________________________________________
sequential_84 (Sequential)      (None, 14, 14, 32)   84000       concatenate_78[0][0]
__________________________________________________________________________________________________
concatenate_79 (Concatenate)    (None, 14, 14, 384)  0           concatenate_78[0][0]
                                                                 sequential_84[0][0]
__________________________________________________________________________________________________
sequential_85 (Sequential)      (None, 14, 14, 32)   88224       concatenate_79[0][0]
__________________________________________________________________________________________________
concatenate_80 (Concatenate)    (None, 14, 14, 416)  0           concatenate_79[0][0]
                                                                 sequential_85[0][0]
__________________________________________________________________________________________________
sequential_86 (Sequential)      (None, 14, 14, 32)   92448       concatenate_80[0][0]
__________________________________________________________________________________________________
concatenate_81 (Concatenate)    (None, 14, 14, 448)  0           concatenate_80[0][0]
                                                                 sequential_86[0][0]
__________________________________________________________________________________________________
sequential_87 (Sequential)      (None, 14, 14, 32)   96672       concatenate_81[0][0]
__________________________________________________________________________________________________
concatenate_82 (Concatenate)    (None, 14, 14, 480)  0           concatenate_81[0][0]
                                                                 sequential_87[0][0]
__________________________________________________________________________________________________
sequential_88 (Sequential)      (None, 14, 14, 32)   100896      concatenate_82[0][0]
__________________________________________________________________________________________________
concatenate_83 (Concatenate)    (None, 14, 14, 512)  0           concatenate_82[0][0]
                                                                 sequential_88[0][0]
__________________________________________________________________________________________________
sequential_89 (Sequential)      (None, 14, 14, 32)   105120      concatenate_83[0][0]
__________________________________________________________________________________________________
concatenate_84 (Concatenate)    (None, 14, 14, 544)  0           concatenate_83[0][0]
                                                                 sequential_89[0][0]
__________________________________________________________________________________________________
sequential_90 (Sequential)      (None, 14, 14, 32)   109344      concatenate_84[0][0]
__________________________________________________________________________________________________
concatenate_85 (Concatenate)    (None, 14, 14, 576)  0           concatenate_84[0][0]
                                                                 sequential_90[0][0]
__________________________________________________________________________________________________
sequential_91 (Sequential)      (None, 14, 14, 32)   113568      concatenate_85[0][0]
__________________________________________________________________________________________________
concatenate_86 (Concatenate)    (None, 14, 14, 608)  0           concatenate_85[0][0]
                                                                 sequential_91[0][0]
__________________________________________________________________________________________________
sequential_92 (Sequential)      (None, 14, 14, 32)   117792      concatenate_86[0][0]
__________________________________________________________________________________________________
concatenate_87 (Concatenate)    (None, 14, 14, 640)  0           concatenate_86[0][0]
                                                                 sequential_92[0][0]
__________________________________________________________________________________________________
sequential_93 (Sequential)      (None, 14, 14, 32)   122016      concatenate_87[0][0]
__________________________________________________________________________________________________
concatenate_88 (Concatenate)    (None, 14, 14, 672)  0           concatenate_87[0][0]
                                                                 sequential_93[0][0]
__________________________________________________________________________________________________
sequential_94 (Sequential)      (None, 14, 14, 32)   126240      concatenate_88[0][0]
__________________________________________________________________________________________________
concatenate_89 (Concatenate)    (None, 14, 14, 704)  0           concatenate_88[0][0]
                                                                 sequential_94[0][0]
__________________________________________________________________________________________________
sequential_95 (Sequential)      (None, 14, 14, 32)   130464      concatenate_89[0][0]
__________________________________________________________________________________________________
concatenate_90 (Concatenate)    (None, 14, 14, 736)  0           concatenate_89[0][0]
                                                                 sequential_95[0][0]
__________________________________________________________________________________________________
sequential_96 (Sequential)      (None, 14, 14, 32)   134688      concatenate_90[0][0]
__________________________________________________________________________________________________
concatenate_91 (Concatenate)    (None, 14, 14, 768)  0           concatenate_90[0][0]
                                                                 sequential_96[0][0]
__________________________________________________________________________________________________
sequential_97 (Sequential)      (None, 14, 14, 32)   138912      concatenate_91[0][0]
__________________________________________________________________________________________________
concatenate_92 (Concatenate)    (None, 14, 14, 800)  0           concatenate_91[0][0]
                                                                 sequential_97[0][0]
__________________________________________________________________________________________________
sequential_98 (Sequential)      (None, 14, 14, 32)   143136      concatenate_92[0][0]
__________________________________________________________________________________________________
concatenate_93 (Concatenate)    (None, 14, 14, 832)  0           concatenate_92[0][0]
                                                                 sequential_98[0][0]
__________________________________________________________________________________________________
sequential_99 (Sequential)      (None, 14, 14, 32)   147360      concatenate_93[0][0]
__________________________________________________________________________________________________
concatenate_94 (Concatenate)    (None, 14, 14, 864)  0           concatenate_93[0][0]
                                                                 sequential_99[0][0]
__________________________________________________________________________________________________
sequential_100 (Sequential)     (None, 14, 14, 32)   151584      concatenate_94[0][0]
__________________________________________________________________________________________________
concatenate_95 (Concatenate)    (None, 14, 14, 896)  0           concatenate_94[0][0]
                                                                 sequential_100[0][0]
__________________________________________________________________________________________________
sequential_101 (Sequential)     (None, 14, 14, 32)   155808      concatenate_95[0][0]
__________________________________________________________________________________________________
concatenate_96 (Concatenate)    (None, 14, 14, 928)  0           concatenate_95[0][0]
                                                                 sequential_101[0][0]
__________________________________________________________________________________________________
sequential_102 (Sequential)     (None, 14, 14, 32)   160032      concatenate_96[0][0]
__________________________________________________________________________________________________
concatenate_97 (Concatenate)    (None, 14, 14, 960)  0           concatenate_96[0][0]
                                                                 sequential_102[0][0]
__________________________________________________________________________________________________
sequential_103 (Sequential)     (None, 14, 14, 32)   164256      concatenate_97[0][0]
__________________________________________________________________________________________________
concatenate_98 (Concatenate)    (None, 14, 14, 992)  0           concatenate_97[0][0]
                                                                 sequential_103[0][0]
__________________________________________________________________________________________________
sequential_104 (Sequential)     (None, 14, 14, 32)   168480      concatenate_98[0][0]
__________________________________________________________________________________________________
concatenate_99 (Concatenate)    (None, 14, 14, 1024) 0           concatenate_98[0][0]
                                                                 sequential_104[0][0]
__________________________________________________________________________________________________
sequential_105 (Sequential)     (None, 7, 7, 512)    528896      concatenate_99[0][0]
__________________________________________________________________________________________________
sequential_106 (Sequential)     (None, 7, 7, 32)     105120      sequential_105[0][0]
__________________________________________________________________________________________________
concatenate_100 (Concatenate)   (None, 7, 7, 544)    0           sequential_105[0][0]
                                                                 sequential_106[0][0]
__________________________________________________________________________________________________
sequential_107 (Sequential)     (None, 7, 7, 32)     109344      concatenate_100[0][0]
__________________________________________________________________________________________________
concatenate_101 (Concatenate)   (None, 7, 7, 576)    0           concatenate_100[0][0]
                                                                 sequential_107[0][0]
__________________________________________________________________________________________________
sequential_108 (Sequential)     (None, 7, 7, 32)     113568      concatenate_101[0][0]
__________________________________________________________________________________________________
concatenate_102 (Concatenate)   (None, 7, 7, 608)    0           concatenate_101[0][0]
                                                                 sequential_108[0][0]
__________________________________________________________________________________________________
sequential_109 (Sequential)     (None, 7, 7, 32)     117792      concatenate_102[0][0]
__________________________________________________________________________________________________
concatenate_103 (Concatenate)   (None, 7, 7, 640)    0           concatenate_102[0][0]
                                                                 sequential_109[0][0]
__________________________________________________________________________________________________
sequential_110 (Sequential)     (None, 7, 7, 32)     122016      concatenate_103[0][0]
__________________________________________________________________________________________________
concatenate_104 (Concatenate)   (None, 7, 7, 672)    0           concatenate_103[0][0]
                                                                 sequential_110[0][0]
__________________________________________________________________________________________________
sequential_111 (Sequential)     (None, 7, 7, 32)     126240      concatenate_104[0][0]
__________________________________________________________________________________________________
concatenate_105 (Concatenate)   (None, 7, 7, 704)    0           concatenate_104[0][0]
                                                                 sequential_111[0][0]
__________________________________________________________________________________________________
sequential_112 (Sequential)     (None, 7, 7, 32)     130464      concatenate_105[0][0]
__________________________________________________________________________________________________
concatenate_106 (Concatenate)   (None, 7, 7, 736)    0           concatenate_105[0][0]
                                                                 sequential_112[0][0]
__________________________________________________________________________________________________
sequential_113 (Sequential)     (None, 7, 7, 32)     134688      concatenate_106[0][0]
__________________________________________________________________________________________________
concatenate_107 (Concatenate)   (None, 7, 7, 768)    0           concatenate_106[0][0]
                                                                 sequential_113[0][0]
__________________________________________________________________________________________________
sequential_114 (Sequential)     (None, 7, 7, 32)     138912      concatenate_107[0][0]
__________________________________________________________________________________________________
concatenate_108 (Concatenate)   (None, 7, 7, 800)    0           concatenate_107[0][0]
                                                                 sequential_114[0][0]
__________________________________________________________________________________________________
sequential_115 (Sequential)     (None, 7, 7, 32)     143136      concatenate_108[0][0]
__________________________________________________________________________________________________
concatenate_109 (Concatenate)   (None, 7, 7, 832)    0           concatenate_108[0][0]
                                                                 sequential_115[0][0]
__________________________________________________________________________________________________
sequential_116 (Sequential)     (None, 7, 7, 32)     147360      concatenate_109[0][0]
__________________________________________________________________________________________________
concatenate_110 (Concatenate)   (None, 7, 7, 864)    0           concatenate_109[0][0]
                                                                 sequential_116[0][0]
__________________________________________________________________________________________________
sequential_117 (Sequential)     (None, 7, 7, 32)     151584      concatenate_110[0][0]
__________________________________________________________________________________________________
concatenate_111 (Concatenate)   (None, 7, 7, 896)    0           concatenate_110[0][0]
                                                                 sequential_117[0][0]
__________________________________________________________________________________________________
sequential_118 (Sequential)     (None, 7, 7, 32)     155808      concatenate_111[0][0]
__________________________________________________________________________________________________
concatenate_112 (Concatenate)   (None, 7, 7, 928)    0           concatenate_111[0][0]
                                                                 sequential_118[0][0]
__________________________________________________________________________________________________
sequential_119 (Sequential)     (None, 7, 7, 32)     160032      concatenate_112[0][0]
__________________________________________________________________________________________________
concatenate_113 (Concatenate)   (None, 7, 7, 960)    0           concatenate_112[0][0]
                                                                 sequential_119[0][0]
__________________________________________________________________________________________________
sequential_120 (Sequential)     (None, 7, 7, 32)     164256      concatenate_113[0][0]
__________________________________________________________________________________________________
concatenate_114 (Concatenate)   (None, 7, 7, 992)    0           concatenate_113[0][0]
                                                                 sequential_120[0][0]
__________________________________________________________________________________________________
sequential_121 (Sequential)     (None, 7, 7, 32)     168480      concatenate_114[0][0]
__________________________________________________________________________________________________
concatenate_115 (Concatenate)   (None, 7, 7, 1024)   0           concatenate_114[0][0]
                                                                 sequential_121[0][0]
__________________________________________________________________________________________________
batch_normalization_122 (BatchN (None, 7, 7, 1024)   4096        concatenate_115[0][0]
__________________________________________________________________________________________________
re_lu_122 (ReLU)                (None, 7, 7, 1024)   0           batch_normalization_122[0][0]
__________________________________________________________________________________________________
global_average_pooling2d_1 (Glo (None, 1024)         0           re_lu_122[0][0]
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 100)          102500      global_average_pooling2d_1[0][0]
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 10)           1010        dense_2[0][0]
==================================================================================================
Total params: 7,151,254
Trainable params: 7,067,606
Non-trainable params: 83,648
__________________________________________________________________________________________________